/*
Реализацию producer-consumer на условных переменных мы напишем на паре 30/09/26. При этом пара мьютекс + набор условных переменных фактически реализуют нам поведение, идентичное монитору Хора.

Комментарий:
Две "канонические" реализации producer-consumer на Posix Threads:

1) На двух условных переменных (есть элементы -- сигналим, есть место -- сигналим) и мьютексе (как на лекции) -- в примерах к glibc: https://elixir.bootlin.com/glibc/glibc-2.2.2/source/linuxthreads/Examples/ex2.c
2) Реализация М. Керриска https://man7.org/tlpi/code/online/dist/threads/prod_condvar.c.html
Заметим, что в ней только одна условная переменная, так как буфер эмулируется переменной, и автором предполагается, что она не переполнится
*/
